In [4]:
import numpy as np
import pandas as pd

In [2]:
list1=[1,2,3,4]
pd.Series(list1)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.Series(list1,['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
pd.Series(np.array([1,2]),[1,2])

1    1
2    2
dtype: int32

In [6]:
pd.Series(np.array(['a',22,print]))

0                            a
1                           22
2    <built-in function print>
dtype: object

## Accessing elements

In [8]:
ser1=pd.Series(['a','b','c','d'])
ser1

0    a
1    b
2    c
3    d
dtype: object

In [30]:
ser1[1]

'b'

In [11]:
ser1[1:4]

1    b
2    c
3    d
dtype: object

In [12]:
ser1.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [18]:
ser2=pd.Series([1,2,3,4],['a','b','d','c'])

In [19]:
ser2

a    1
b    2
d    3
c    4
dtype: int64

In [15]:
#pd.Series(data,index)

In [16]:
ser2['b']

2

In [20]:
ser2['b':'c']

b    2
d    3
c    4
dtype: int64

In [21]:
#not print according to character abcd

In [22]:
ser2.values

array([1, 2, 3, 4], dtype=int64)

In [23]:
ser2.index

Index(['a', 'b', 'd', 'c'], dtype='object')

In [24]:
ser2

a    1
b    2
d    3
c    4
dtype: int64

In [25]:
ser2.drop('d') #not remove from actual

a    1
b    2
c    4
dtype: int64

In [26]:
ser2

a    1
b    2
d    3
c    4
dtype: int64

In [28]:
ser2.drop('d',inplace=True) #now remove completely

In [29]:
ser2

a    1
b    2
c    4
dtype: int64

In [31]:
ser2['d']=5 #chng index value
ser2

a    1
b    2
c    4
d    5
dtype: int64

## DataFrame
collection of series object

In [9]:
data=np.random.rand(5,3)
data

array([[0.31100721, 0.19975218, 0.29542788],
       [0.27752599, 0.85596354, 0.096921  ],
       [0.74528946, 0.844138  , 0.47784862],
       [0.2974572 , 0.19716668, 0.70204212],
       [0.27655276, 0.90899092, 0.30433204]])

In [33]:
df=pd.DataFrame(data)

In [34]:
df

          0         1         2
0  0.818746  0.117435  0.279719
1  0.990852  0.897241  0.090624
2  0.513872  0.177295  0.844653
3  0.950385  0.869833  0.383933
4  0.354713  0.217340  0.460240

In [35]:
type(df[0])

pandas.core.series.Series

In [10]:
df2=pd.DataFrame(data,index=['a','b','c','d','e'],columns=('col1','col2','col3'))

In [38]:
df2

       col1      col2      col3
a  0.818746  0.117435  0.279719
b  0.990852  0.897241  0.090624
c  0.513872  0.177295  0.844653
d  0.950385  0.869833  0.383933
e  0.354713  0.217340  0.460240

In [39]:
print(df2.columns)

Index(['col1', 'col2', 'col3'], dtype='object')

In [40]:
df2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [41]:
#using dictionaries
df_new=pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6]})

In [42]:
df_new

   col1  col2
0     1     4
1     2     5
2     3     6

 ##  Accessing and Selection

In [11]:
df2

       col1      col2      col3
a  0.311007  0.199752  0.295428
b  0.277526  0.855964  0.096921
c  0.745289  0.844138  0.477849
d  0.297457  0.197167  0.702042
e  0.276553  0.908991  0.304332

In [44]:
df2.col1 #risky

a    0.818746
b    0.990852
c    0.513872
d    0.950385
e    0.354713
Name: col1, dtype: float64

In [45]:
df2['col1'] #better

a    0.818746
b    0.990852
c    0.513872
d    0.950385
e    0.354713
Name: col1, dtype: float64

In [46]:
df2[['col1','col3']]

       col1      col3
a  0.818746  0.279719
b  0.990852  0.090624
c  0.513872  0.844653
d  0.950385  0.383933
e  0.354713  0.460240

In [47]:
## acess row and column by loc and iloc

## loc[]

In [48]:
#rows

In [49]:
df2.loc['d']

col1    0.950385
col2    0.869833
col3    0.383933
Name: d, dtype: float64

In [50]:
type(df2.loc['d'])

pandas.core.series.Series

In [51]:
#multiple rows

In [52]:
df2.loc[['a','d']]

       col1      col2      col3
a  0.818746  0.117435  0.279719
d  0.950385  0.869833  0.383933

In [53]:
df2.loc[['a'],['col1']]

       col1
a  0.818746

In [55]:
df2.loc['a','col1']

0.818746264018077

In [56]:
# multiple

In [57]:
df2.loc[['a','d'],['col1','col2']]

       col1      col2
a  0.818746  0.117435
d  0.950385  0.869833

## iloc[]

In [58]:
#rows

In [59]:
df2.iloc[0]

col1    0.818746
col2    0.117435
col3    0.279719
Name: a, dtype: float64

In [60]:
df2.iloc[0,2]

0.27971939725825035

In [61]:
# for looping use iloc

In [62]:
df2.iloc[[0,1,2],[1,2]]

       col2      col3
a  0.117435  0.279719
b  0.897241  0.090624
c  0.177295  0.844653

## Based on Conditions

In [12]:
df2

       col1      col2      col3
a  0.311007  0.199752  0.295428
b  0.277526  0.855964  0.096921
c  0.745289  0.844138  0.477849
d  0.297457  0.197167  0.702042
e  0.276553  0.908991  0.304332

In [64]:
df2>0.6

    col1   col2   col3
a   True  False  False
b   True   True  False
c  False  False   True
d   True   True  False
e  False  False  False

In [65]:
df2[df2>0.6]

       col1      col2      col3
a  0.818746       NaN       NaN
b  0.990852  0.897241       NaN
c       NaN       NaN  0.844653
d  0.950385  0.869833       NaN
e       NaN       NaN       NaN

In [66]:
df2[df2['col3']>0.6]

       col1      col2      col3
c  0.513872  0.177295  0.844653

In [67]:
df2[(df2['col3']>0.6) & (df2['col1']>0.4)]

       col1      col2      col3
c  0.513872  0.177295  0.844653

In [68]:
df2[df2['col3']>0.6]['col1']

c    0.513872
Name: col1, dtype: float64

In [14]:
df2.append(pd.Series([10,20],index=['col2','col3'],name=0.5))

         col1       col2       col3
a    0.311007   0.199752   0.295428
b    0.277526   0.855964   0.096921
c    0.745289   0.844138   0.477849
d    0.297457   0.197167   0.702042
e    0.276553   0.908991   0.304332
0.5       NaN  10.000000  20.000000